{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "15ee77e1",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from neo4j_graphrag.experimental.pipeline.kg_builder import SimpleKGPipeline\n",
    "from neo4j_graphrag.llm import OpenAILLM, OllamaLLM\n",
    "from neo4j_graphrag.embeddings import OpenAIEmbeddings\n",
    "from neo4j_graphrag.generation.prompts import ERExtractionTemplate\n",
    "from dotenv import load_dotenv\n",
    "import pandas as pd\n",
    "from langchain_core.documents import Document\n",
    "from langchain_community.llms import Ollama\n",
    "from neo4j_graphrag.retrievers import VectorRetriever, VectorCypherRetriever, Text2CypherRetriever\n",
    "from neo4j_graphrag.schema import get_schema\n",
    "from neo4j_graphrag.generation import GraphRAG\n",
    "\n",
    "\n",
    "import os, time, asyncio, glob, csv"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "767505ae",
   "metadata": {},
   "source": [
    "## 1. Initialize Graph Database "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "99165a29",
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv(dotenv_path=\"../.env\")\n",
    "\n",
    "URI = os.getenv(\"NEO4J_URI\")\n",
    "USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "DATABASE_NAME = os.getenv(\"NEO4J_DATABASE\")\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=(USERNAME, PASSWORD))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "51fa866a",
   "metadata": {},
   "source": [
    "### 1.1 Call BGE-M3 Embedding model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "de32702d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "กำลังรันโมเดลบน: CUDA\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Fetching 23 files: 100%|██████████| 23/23 [00:00<00:00, 22985.23it/s]\n"
     ]
    }
   ],
   "source": [
    "import torch\n",
    "from FlagEmbedding import BGEM3FlagModel\n",
    "\n",
    "# เช็คว่ามี GPU (CUDA) หรือไม่\n",
    "# ถ้ามีให้ใช้ 'cuda' ถ้าไม่มีให้ใช้ 'cpu'\n",
    "device = 'cuda' if torch.cuda.is_available() else 'cpu'\n",
    "use_fp16 = True if device == 'cuda' else False  # fp16 ส่วนใหญ่รองรับเฉพาะบน GPU\n",
    "\n",
    "print(f\"กำลังรันโมเดลบน: {device.upper()}\")\n",
    "\n",
    "# 2. Initialize Model\n",
    "embedder = BGEM3FlagModel(\n",
    "    'VISAI-AI/nitibench-ccl-human-finetuned-bge-m3', \n",
    "    use_fp16=use_fp16, \n",
    "    device=device \n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0b92e468",
   "metadata": {},
   "source": [
    "### 1.2 Wrap embedding model\n",
    "เนื่องจาก Embedding model ที่จะใช้ใน Neo4J (เรียกจาก library Neo4J โดยตรง ไม่ใช่ langchain) ไม่สามารถเรียกใช้ Embedding model BGE-M3 ได้โดยตรง ตัว Library รองรับแค่พวก Commercial Models e.g. openai จึงต้องมีการ Wrap เพื่อให้ใช้งานได้ "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "32f3e007",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j_graphrag.embeddings import Embedder\n",
    "\n",
    "class Neo4jCompatibleEmbedder(Embedder):\n",
    "    def __init__(self, original_embedder):\n",
    "        self.original_embedder = original_embedder\n",
    "\n",
    "    def embed_query(self, text: str) -> list[float]:\n",
    "        # 1. เรียกโมเดล M3 (สมมติว่าใช้ .encode)\n",
    "        result = self.original_embedder.encode(text)\n",
    "        \n",
    "        # 2. ตรวจสอบว่าผลลัพธ์เป็น dict หรือไม่ (BGE-M3 มักคืนค่าแบบนี้ถ้าไม่ได้ตั้ง return_dense_only=True)\n",
    "        if isinstance(result, dict):\n",
    "            # ดึงเฉพาะ Dense Vector ออกมา\n",
    "            embedding = result.get('dense_vecs')\n",
    "        else:\n",
    "            embedding = result\n",
    "\n",
    "        # 3. แปลงจาก numpy array เป็น list เพื่อให้ Pydantic/Neo4j ยอมรับ\n",
    "        if hasattr(embedding, \"tolist\"):\n",
    "            return embedding.tolist()\n",
    "        \n",
    "        # กรณีเป็น list อยู่แล้วแต่สมาชิกข้างในอาจเป็น numpy types ให้วนลูปแปลง (ถ้าจำเป็น)\n",
    "        return [float(x) for x in embedding]\n",
    "\n",
    "    def embed_nodes(self, nodes):\n",
    "        for node in nodes:\n",
    "            # node.text คือเนื้อหาที่ถูก Chunk แล้ว\n",
    "            node.embedding = self.embed_query(node.text)\n",
    "\n",
    "# การใช้งาน\n",
    "# ระวังอย่ารันบรรทัดนี้ซ้ำ (เพราะจะกลายเป็น wrap ซ้อน wrap)\n",
    "neo4j_embedder = Neo4jCompatibleEmbedder(embedder)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0674163e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>law_name</th>\n",
       "      <th>section_content</th>\n",
       "      <th>section_num</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546</td>\n",
       "      <td>พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546 มา...</td>\n",
       "      <td>132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์</td>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1598/5\\nถ้าผู...</td>\n",
       "      <td>1598/5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์</td>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 876\\nถ้าผู้รั...</td>\n",
       "      <td>876</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์</td>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1030\\nถ้าผู้เ...</td>\n",
       "      <td>1030</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์</td>\n",
       "      <td>ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 849\\nการรับเง...</td>\n",
       "      <td>849</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      law_name  \\\n",
       "0  พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546   \n",
       "1                   ประมวลกฎหมายแพ่งและพาณิชย์   \n",
       "2                   ประมวลกฎหมายแพ่งและพาณิชย์   \n",
       "3                   ประมวลกฎหมายแพ่งและพาณิชย์   \n",
       "4                   ประมวลกฎหมายแพ่งและพาณิชย์   \n",
       "\n",
       "                                     section_content section_num  \n",
       "0  พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546 มา...         132  \n",
       "1  ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1598/5\\nถ้าผู...      1598/5  \n",
       "2  ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 876\\nถ้าผู้รั...         876  \n",
       "3  ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1030\\nถ้าผู้เ...        1030  \n",
       "4  ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 849\\nการรับเง...         849  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_parquet('../data/processed/nitibench_cleaned_2026-03-17.parquet')\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9460e0c",
   "metadata": {},
   "source": [
    "## 2. Chunking to documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "042eb0e2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[Document(metadata={'law_name': 'พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546', 'section_num': '132'}, page_content='กฎหมาย: พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546\\nมาตรา: 132\\nเนื้อหา: พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546 มาตรา 132 ผู้ใดประกอบกิจการในลักษณะเป็นศูนย์ซื้อขายสัญญาซื้อขายล่วงหน้าโดยไม่ได้รับใบอนุญาตหรือไม่ได้จดทะเบียนตามมาตรา 54 ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินสามแสนบาท หรือทั้งจำทั้งปรับ และปรับอีกไม่เกินวันละหนึ่งหมื่นบาทตลอดเวลาที่ยังฝ่าฝืน'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1598/5'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1598/5\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1598/5\\nถ้าผู้อยู่ในปกครองรู้จักผิดชอบและมีอายุไม่ต่ำกว่าสิบห้าปีบริบูรณ์เมื่อผู้ปกครองจะทำกิจการใดที่สำคัญ ให้ปรึกษาหารือผู้อยู่ในปกครองก่อนเท่าที่จะทำได้\\nการที่ผู้อยู่ในปกครองได้ยินยอมด้วยนั้นหาคุ้มผู้ปกครองให้พ้นจากความรับผิดไม่'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '876'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 876\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 876\\nถ้าผู้รับประกันภัยต้องคำพิพากษาให้เป็นคนล้มละลาย ผู้เอาประกันภัยจะเรียกให้หาประกันอันสมควรให้แก่ตนก็ได้ หรือจะบอกเลิกสัญญาเสียก็ได้\\nถ้าผู้เอาประกันภัยต้องคำพิพากษาให้เป็นคนล้มละลาย ท่านให้ใช้วิธีเดียวกันนี้บังคับตามควรแก่เรื่อง แต่กระนั้นก็ดี ถ้าเบี้ยประกันภัยได้ส่งแล้วเต็มจำนวนเพื่ออายุประกันภัยเป็นระยะเวลามากน้อยเท่าใดไซร้ ท่านห้ามมิให้ผู้รับประกันภัยบอกเลิกสัญญาก่อนระยะเวลานั้นสุดลง'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1030'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1030\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1030\\nถ้าผู้เป็นหุ้นส่วนคนหนึ่งให้กรรมสิทธิ์ในทรัพย์สินอันใดอันหนึ่งเป็นการลงหุ้นด้วยไซร้ ความเกี่ยวพันระหว่างผู้เป็นหุ้นส่วนคนนั้นกับห้างหุ้นส่วนในเรื่องส่งมอบและซ่อมแซมก็ดี ความรับผิดเพื่อชำรุดบกพร่องก็ดี ความรับผิดเพื่อการรอนสิทธิก็ดี ข้อยกเว้นความรับผิดก็ดี ท่านให้บังคับตามบทบัญญัติแห่งประมวลกฎหมายนี้ ว่าด้วยซื้อขาย'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '849'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 849\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 849\\nการรับเงินหรือรับชำระหนี้อันจะพึงชำระตามสัญญานั้น ท่านให้สันนิษฐานไว้ก่อนว่านายหน้าย่อมไม่มีอำนาจที่จะรับแทนผู้เป็นคู่สัญญา'),\n",
       " Document(metadata={'law_name': 'พระราชบัญญัติหลักประกันทางธุรกิจ พ.ศ. 2558', 'section_num': '9'}, page_content='กฎหมาย: พระราชบัญญัติหลักประกันทางธุรกิจ พ.ศ. 2558\\nมาตรา: 9\\nเนื้อหา: พระราชบัญญัติหลักประกันทางธุรกิจ พ.ศ. 2558 มาตรา 9 ผู้ให้หลักประกันจะนำทรัพย์สินที่ตนมีสิทธิอยู่ในปัจจุบันหรือที่จะได้มาในอนาคตตามสัญญาหรือนิติสัมพันธ์ใด ๆ มาใช้เป็นหลักประกันก็ได้ แต่สิทธิเหนือทรัพย์สินอันเป็นวัตถุแห่งสิทธิที่เป็นหลักประกันตามสัญญาจะมีขึ้นเมื่อผู้ให้หลักประกันได้มาซึ่งทรัพย์สินนั้น'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '565'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 565\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 565\\nการเช่าถือสวนนั้น ท่านให้สันนิษฐานไว้ก่อนว่าเช่ากันปีหนึ่ง\\nการเช่านาก็ให้สันนิษฐานไว้ก่อนว่าเช่ากันตลอดฤดูทำนาปีหนึ่ง'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1598/26'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1598/26\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1598/26\\nผู้เยาว์ที่เป็นบุตรบุญธรรมของบุคคลใดอยู่จะเป็นบุตรบุญธรรมของบุคคลอื่นอีกในขณะเดียวกันไม่ได้ เว้นแต่เป็นบุตรบุญธรรมของคู่สมรสของผู้รับบุตรบุญธรรม\\nถ้าคู่สมรสฝ่ายหนึ่งจะจดทะเบียนรับผู้เยาว์ซึ่งเป็นบุตรบุญธรรมของคู่สมรสอีกฝ่ายหนึ่งเป็นบุตรบุญธรรมของตนด้วยจะต้องได้รับความยินยอมของคู่สมรสซึ่งเป็นผู้รับบุตรบุญธรรมอยู่แล้วและมิให้นำมาตรา 1598/21 มาใช้บังคับ'),\n",
       " Document(metadata={'law_name': 'พระราชบัญญัติการบัญชี พ.ศ. 2543', 'section_num': '21'}, page_content='กฎหมาย: พระราชบัญญัติการบัญชี พ.ศ. 2543\\nมาตรา: 21\\nเนื้อหา: พระราชบัญญัติการบัญชี พ.ศ. 2543 มาตรา 21 ในการลงรายการในบัญชี ผู้ทำบัญชีต้องปฏิบัติ ดังต่อไปนี้\\n(1) ลงรายการเป็นภาษาไทย หากลงรายการเป็นภาษาต่างประเทศให้มีภาษาไทยกำกับ หรือลงรายการเป็นรหัสบัญชีให้มีคู่มือแปลรหัสที่เป็นภาษาไทยไว้\\n(2) เขียนด้วยหมึก ดีดพิมพ์ ตีพิมพ์ หรือทำด้วยวิธีอื่นใดที่ได้ผลในทำนองเดียวกัน'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '193'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 193\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 193\\nในกรณีดังต่อไปนี้ ฝ่ายลูกหนี้จะถือเอาประโยชน์แห่งเงื่อนเวลาเริ่มต้นหรือเงื่อนเวลาสิ้นสุดมิได้\\n(1) ลูกหนี้ถูกศาลสั่งพิทักษ์ทรัพย์เด็ดขาดตามกฎหมายว่าด้วยล้มละลาย\\n(2) ลูกหนี้ไม่ให้ประกันในเมื่อจำต้องให้\\n(3) ลูกหนี้ได้ทำลาย หรือทำให้ลดน้อยถอยลงซึ่งประกันอันได้ให้ไว้\\n(4) ลูกหนี้นำทรัพย์สินของบุคคลอื่นมาให้เป็นประกันโดยเจ้าของทรัพย์สินนั้นมิได้ยินยอมด้วย'),\n",
       " Document(metadata={'law_name': 'ประมวลรัษฎากร', 'section_num': '119'}, page_content='กฎหมาย: ประมวลรัษฎากร\\nมาตรา: 119\\nเนื้อหา: ประมวลรัษฎากร มาตรา 119 ตราสารซึ่งเจ้าพนักงานรัฐบาลหรือเทศบาลต้องลงนามหรือรับรู้ก็ดี ตราสารซึ่งต้องทำต่อหน้าเจ้าพนักงานรัฐบาลหรือเทศบาลก็ดี ตราสารซึ่งต้องให้เจ้าพนักงานรัฐบาลหรือเทศบาลลงบันทึกก็ดี ห้ามมิให้เจ้าพนักงานลงนามรับรู้ ยอมให้ทำหรือบันทึกไว้จนกว่าจะได้เสียอากรโดยปิดแสตมป์ครบจำนวนตามอัตราในบัญชีท้ายหมวดนี้ และขีดฆ่าแล้ว แต่ทั้งนี้ ไม่เป็นการเสื่อมสิทธิที่จะเรียกเงินเพิ่มอากรตามมาตรา 113 และมาตรา 114'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '485'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 485\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 485\\nข้อสัญญาว่าจะไม่ต้องรับผิดนั้น ไม่อาจคุ้มความรับผิดของผู้ขายในผลของการอันผู้ขายได้กระทำไปเอง หรือผลแห่งข้อความจริงอันผู้ขายได้รู้อยู่แล้วและปกปิดเสีย'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1396'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1396\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1396\\nภาระจำยอมซึ่งเจ้าของรวมแห่งสามยทรัพย์คนหนึ่งได้มา หรือใช้อยู่นั้น ท่านให้ถือว่าเจ้าของรวมได้มาหรือใช้อยู่ด้วยกันทุกคน'),\n",
       " Document(metadata={'law_name': 'ประมวลรัษฎากร', 'section_num': '86/3'}, page_content='กฎหมาย: ประมวลรัษฎากร\\nมาตรา: 86/3\\nเนื้อหา: ประมวลรัษฎากร มาตรา 86/3 ในการขายทอดตลาดตามมาตรา 83/5 ให้ผู้ทอดตลาดที่มิใช่ส่วนราชการซึ่งขายทรัพย์สินของผู้ประกอบการจดทะเบียนออกใบกำกับภาษีหรือใบรับตามมาตรา 105 แล้วแต่กรณี ในนามของผู้ประกอบการจดทะเบียนเจ้าของทรัพย์สิน'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '582'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 582\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 582\\nถ้าคู่สัญญาไม่ได้กำหนดลงไว้ในสัญญาว่าจะจ้างกันนานเท่าไร ท่านว่าฝ่ายใดฝ่ายหนึ่งจะเลิกสัญญาด้วยการบอกกล่าวล่วงหน้าในเมื่อถึงหรือก่อนจะถึงกำหนดจ่ายสินจ้างคราวใดคราวหนึ่ง เพื่อให้เป็นผลเลิกสัญญากันเมื่อถึงกำหนดจ่ายสินจ้างคราวถัดไปข้างหน้าก็อาจทำได้ แต่ไม่จำต้องบอกกล่าวล่วงหน้ากว่าสามเดือน\\nอนึ่ง ในเมื่อบอกกล่าวดังว่านี้ นายจ้างจะจ่ายสินจ้างแก่ลูกจ้างเสียให้ครบจำนวนที่จะต้องจ่ายจนถึงเวลาเลิกสัญญาตามกำหนดที่บอกกล่าวนั้นทีเดียว แล้วปล่อยลูกจ้างจากงานเสียในทันทีก็อาจทำได้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1262'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1262\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1262\\nถ้ามีมติของที่ประชุมใหญ่หรือคำบังคับของศาลให้อำนาจผู้ชำระบัญชีให้ทำการแยกกันได้ ท่านว่าต้องนำความจดทะเบียนภายในสิบสี่วันนับแต่วันลงมติหรือออกคำบังคับนั้น'),\n",
       " Document(metadata={'law_name': 'ประมวลรัษฎากร', 'section_num': '82/2'}, page_content='กฎหมาย: ประมวลรัษฎากร\\nมาตรา: 82/2\\nเนื้อหา: ประมวลรัษฎากร มาตรา 82/2 ในกรณีผู้ประกอบการอยู่นอกราชอาณาจักร ให้ผู้มีหน้าที่รับผิดชอบในการประกอบกิจการ รวมตลอดถึง ลูกจ้าง หรือผู้ทำการแทนซึ่งมีอำนาจในการจัดการแทนโดยตรงหรือโดยปริยายที่อยู่ในราชอาณาจักร เป็นผู้มีหน้าที่เสียภาษีมูลค่าเพิ่มร่วมกับบุคคลตามมาตรา 82'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '386'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 386\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 386\\nถ้าคู่สัญญาฝ่ายหนึ่งมีสิทธิเลิกสัญญาโดยข้อสัญญาหรือโดยบทบัญญัติแห่งกฎหมาย การเลิกสัญญาเช่นนั้นย่อมทำด้วยแสดงเจตนาแก่อีกฝ่ายหนึ่ง\\nแสดงเจตนาดังกล่าวมาในวรรคก่อนนั้น ท่านว่าหาอาจจะถอนได้ไม่'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '694'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 694\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 694\\nนอกจากข้อต่อสู้ซึ่งผู้ค้ำประกันมีต่อเจ้าหนี้นั้น ท่านว่าผู้ค้ำประกันยังอาจยกข้อต่อสู้ทั้งหลายซึ่งลูกหนี้มีต่อเจ้าหนี้ขึ้นต่อสู้ได้ด้วย'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1708'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1708\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1708\\nเมื่อผู้ทำพินัยกรรมตายแล้ว บุคคลผู้มีส่วนได้เสียคนใดคนหนึ่งจะร้องขอให้ศาลสั่งเพิกถอนพินัยกรรมซึ่งได้ทำขึ้นเพราะเหตุข่มขู่ก็ได้ แต่หากผู้ทำพินัยกรรมยังมีชีวิตอยู่ต่อมาเกินหนึ่งปีนับแต่ผู้ทำพินัยกรรมพ้นจากการข่มขู่แล้ว จะมีการร้องขอเช่นว่านั้นไม่ได้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1364'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1364\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1364\\nการแบ่งทรัพย์สินพึงกระทำโดยแบ่งทรัพย์สินนั้นเองระหว่างเจ้าของรวม หรือโดยขายทรัพย์สินแล้วเอาเงินที่ขายได้แบ่งกัน\\nถ้าเจ้าของรวมไม่ตกลงกันว่าจะแบ่งทรัพย์สินอย่างไรไซร้ เมื่อเจ้าของรวมคนหนึ่งคนใดขอ ศาลอาจสั่งให้เอาทรัพย์สินนั้นออกแบ่ง ถ้าส่วนที่แบ่งให้ไม่เท่ากันไซร้ จะสั่งให้ทดแทนกันเป็นเงินก็ได้ ถ้าการแบ่งเช่นว่านี้ไม่อาจทำได้หรือจะเสียหายมากนักก็ดี ศาลจะสั่งให้ขายโดยประมูลราคากันระหว่างเจ้าของรวมหรือขายทอดตลาดก็ได้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '660'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 660\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 660\\nถ้าผู้ฝากมิได้อนุญาต และผู้รับฝากเอาทรัพย์สินซึ่งฝากนั้นออกใช้สอยเอง หรือเอาไปให้บุคคลภายนอกใช้สอย หรือให้บุคคลภายนอกเก็บรักษาไซร้ ท่านว่าผู้รับฝากจะต้องรับผิดเมื่อทรัพย์สินซึ่งฝากนั้นสูญหายหรือบุบสลายอย่างหนึ่งอย่างใด แม้ถึงจะเป็นเพราะเหตุสุดวิสัย เว้นแต่จะพิสูจน์ได้ว่าถึงอย่างไร ๆ ทรัพย์สินนั้นก็คงจะต้องสูญหายหรือบุบสลายอยู่นั่นเอง'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '369'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 369\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 369\\nในสัญญาต่างตอบแทนนั้น คู่สัญญาฝ่ายหนึ่งจะไม่ยอมชำระหนี้จนกว่าอีกฝ่ายหนึ่งจะชำระหนี้ หรือขอปฏิบัติการชำระหนี้ก็ได้ แต่ความข้อนี้ท่านมิให้ใช้บังคับ ถ้าหนี้ของคู่สัญญาอีกฝ่ายหนึ่งยังไม่ถึงกำหนด'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '719'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 719\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 719\\nจำนองที่ดินไม่ครอบไปถึงเรือนโรงอันผู้จำนองปลูกสร้างลงในที่ดินภายหลังวันจำนอง เว้นแต่จะมีข้อความกล่าวไว้โดยเฉพาะในสัญญาว่าให้ครอบไปถึง\\nแต่กระนั้นก็ดี ผู้รับจำนองจะให้ขายเรือนโรงนั้นรวมไปกับที่ดินด้วยก็ได้ แต่ผู้รับจำนองอาจใช้บุริมสิทธิของตนได้เพียงแก่ราคาที่ดินเท่านั้น'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '878'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 878\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 878\\nค่าใช้จ่ายในการตีราคาวินาศภัยนั้น ท่านว่าผู้รับประกันภัยต้องเป็นผู้ออกใช้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1129'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1129\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1129\\nอันว่าหุ้นนั้นย่อมโอนกันได้โดยมิต้องได้รับความยินยอมของบริษัท เว้นแต่เมื่อเป็นหุ้นชนิดระบุชื่อลงในใบหุ้น ซึ่งมีข้อบังคับของบริษัทกำหนดไว้เป็นอย่างอื่น\\nการโอนหุ้นชนิดระบุชื่อลงในใบหุ้นนั้น ถ้ามิได้ทำเป็นหนังสือและลงลายมือชื่อของผู้โอนกับผู้รับโอน มีพยานคนหนึ่งเป็นอย่างน้อยลงชื่อรับรองลายมือนั้น ๆ ด้วยแล้ว ท่านว่าเป็นโมฆะ อนึ่ง ตราสารอันนั้นต้องแถลงเลขหมายของหุ้นซึ่งโอนกันนั้นด้วย\\nการโอนเช่นนี้จะนำมาใช้แก่บริษัทหรือบุคคลภายนอกไม่ได้ จนกว่าจะได้จดแจ้งการโอนทั้งชื่อและสำนักของผู้รับโอนนั้นลงในทะเบียนผู้ถือหุ้น'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '605'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 605\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 605\\nถ้าการที่จ้างยังทำไม่แล้วเสร็จอยู่ตราบใด ผู้ว่าจ้างอาจบอกเลิกสัญญาได้ เมื่อเสียค่าสินไหมทดแทนให้แก่ผู้รับจ้างเพื่อความเสียหายอย่างใด ๆ อันเกิดแต่การเลิกสัญญานั้น'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '942'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 942\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 942\\nอันจะบังคับให้ผู้ทรงตั๋วแลกเงินรับเงินใช้ก่อนตั๋วเงินถึงกำหนดนั้น ท่านว่าหาอาจจะทำได้ไม่\\nอนึ่ง ผู้จ่ายคนใดใช้เงินไปแต่ก่อนเวลาตั๋วเงินถึงกำหนด ท่านว่าย่อมทำเช่นนั้นด้วยเสี่ยงเคราะห์ของตนเอง'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '193/21'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 193/21\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 193/21\\nอายุความสิทธิเรียกร้องของผู้เยาว์หรือของคนไร้ความสามารถหรือของคนเสมือนไร้ความสามารถ ที่จะฟ้องร้องผู้แทนโดยชอบธรรมหรือผู้อนุบาลหรือผู้พิทักษ์ของตนนั้น ถ้าจะครบกำหนดลงในขณะที่บุคคลดังกล่าวยังไม่ลุถึงความสามารถเต็มภูมิ หรือในระหว่างหนึ่งปีนับแต่วันที่บุคคลดังกล่าวไม่มีผู้แทนโดยชอบธรรมหรือผู้อนุบาลหรือผู้พิทักษ์ อายุความนั้นยังไม่ครบกำหนดจนกว่าจะครบหนึ่งปีนับแต่วันที่บุคคลนั้นได้ลุถึงความสามารถเต็มภูมิหรือได้มีผู้แทนโดยชอบธรรมหรือผู้อนุบาลหรือผู้พิทักษ์ แล้วแต่กรณี แต่ถ้าอายุความสิทธิเรียกร้องนั้นมีระยะเวลาน้อยกว่าหนึ่งปี ก็ให้นำกำหนดระยะเวลาที่สั้นกว่านั้นมาใช้แทนกำหนดระยะเวลาหนึ่งปีดังกล่าว'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1003'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1003\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1003\\nในคดีผู้สลักหลังทั้งหลายฟ้องไล่เบี้ยกันเองและไล่เบี้ยเอาแก่ผู้สั่งจ่ายแห่งตั๋วเงิน ท่านห้ามมิให้ฟ้องคดีเมื่อพ้นเวลาหกเดือนนับแต่วันที่ผู้สลักหลังเข้าถือเอาตั๋วเงินและใช้เงิน หรือนับแต่วันที่ผู้สลักหลังนั้นเองถูกฟ้อง'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '138'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 138\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 138\\nทรัพย์สิน หมายความรวมทั้งทรัพย์และวัตถุไม่มีรูปร่าง ซึ่งอาจมีราคาและอาจถือเอาได้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '334'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 334\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 334\\nลูกหนี้มีสิทธิจะถอนทรัพย์ที่วางนั้นได้ ถ้าลูกหนี้ถอนทรัพย์นั้น ท่านให้ถือเสมือนว่ามิได้วางทรัพย์ไว้เลย\\nสิทธิถอนทรัพย์นี้เป็นอันขาดในกรณีต่อไปนี้\\n(1) ถ้าลูกหนี้แสดงต่อสำนักงานวางทรัพย์ว่าตนยอมละสิทธิที่จะถอน\\n(2) ถ้าเจ้าหนี้แสดงต่อสำนักงานวางทรัพย์ว่าจะรับเอาทรัพย์นั้น\\n(3) ถ้าการวางทรัพย์นั้นได้เป็นไปโดยคำสั่งหรืออนุมัติของศาลและได้บอกกล่าวความนั้นแก่สำนักงานวางทรัพย์'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '504'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 504\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 504\\nในข้อรับผิดเพื่อการส่งของไม่ตรงตามตัวอย่าง หรือไม่ตรงตามคำพรรณนานั้น ท่านห้ามมิให้ฟ้องคดีเมื่อพ้นกำหนดปีหนึ่งนับแต่เวลาส่งมอบ'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1321'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1321\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1321\\nภายในบังคับแห่งกฎหมายเฉพาะและกฎข้อบังคับในเรื่องนั้น ผู้ใดจับสัตว์ป่าได้ในที่รกร้างว่างเปล่าหรือในที่น้ำสาธารณะก็ดี หรือจับได้ในที่ดิน หรือที่น้ำมีเจ้าของโดยเจ้าของมิได้แสดงความหวงห้ามก็ดี ท่านว่าผู้นั้นเป็นเจ้าของสัตว์'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1315'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1315\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1315\\nบุคคลใดสร้างโรงเรือน หรือทำการก่อสร้างอย่างอื่นซึ่งติดที่ดิน หรือเพาะปลูกต้นไม้หรือธัญชาติในที่ดินของตนด้วยสัมภาระของผู้อื่น ท่านว่าบุคคลนั้นเป็นเจ้าของสัมภาระ แต่ต้องใช้ค่าสัมภาระ'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '368'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 368\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 368\\nสัญญานั้นท่านให้ตีความไปตามความประสงค์ในทางสุจริต โดยพิเคราะห์ถึงปรกติประเพณีด้วย'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1083'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1083\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1083\\nการลงหุ้นของผู้เป็นหุ้นส่วนจำพวกจำกัดความรับผิดนั้น ท่านว่าต้องให้ลงเป็นเงินหรือทรัพย์สินอย่างอื่น ๆ'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '442'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 442\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 442\\nถ้าความเสียหายได้เกิดขึ้นเพราะความผิดอย่างหนึ่งอย่างใดของผู้ต้องเสียหายประกอบด้วยไซร้ ท่านให้นำบทบัญญัติแห่งมาตรา 223 มาใช้บังคับ โดยอนุโลม'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1653'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1653\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1653\\nผู้เขียน หรือพยานในพินัยกรรมจะเป็นผู้รับทรัพย์ตามพินัยกรรมนั้นไม่ได้\\nให้ใช้บทบัญญัติในวรรคก่อนบังคับแก่คู่สมรสของผู้เขียนหรือพยานในพินัยกรรมด้วย\\nพนักงานเจ้าหน้าที่ซึ่งได้จดข้อความแห่งพินัยกรรมที่พยานนำมาแจ้งตามมาตรา 1663 ให้ถือว่าเป็นผู้เขียนพินัยกรรมตามความหมายแห่งมาตรานี้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '584'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 584\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 584\\nถ้าจ้างแรงงานรายใดมีสาระสำคัญอยู่ที่ตัวบุคคลผู้เป็นนายจ้าง ท่านว่าสัญญาจ้างเช่นนั้นย่อมระงับไปด้วยมรณะแห่งนายจ้าง'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1424'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1424\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1424\\nผู้ทรงสิทธิเก็บกินจำต้องสงวนภาวะแห่งทรัพย์สินมิให้เปลี่ยนไปในสาระสำคัญ กับต้องบำรุงรักษาปกติและซ่อมแซมเล็กน้อยด้วย\\nถ้าจำเป็นต้องซ่อมแซมใหญ่ หรือมีการสำคัญอันต้องทำเพื่อรักษาทรัพย์สินไซร้ ท่านว่าผู้ทรงสิทธิเก็บกินต้องแจ้งแก่เจ้าของทรัพย์สินโดยพลัน และต้องยอมให้จัดทำการนั้น ๆ ไป ถ้าเจ้าของทรัพย์สินละเลยเสีย ท่านว่าผู้ทรงสิทธิเก็บกินจะจัดทำการนั้นไปโดยให้เจ้าของทรัพย์สินออกค่าใช้จ่ายก็ได้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1649'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1649\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1649\\nผู้จัดการมรดกซึ่งผู้ตายตั้งไว้ย่อมมีอำนาจและหน้าที่ในอันที่จะจัดการทำศพของผู้ตาย เว้นแต่ผู้ตายจะได้ตั้งบุคคลอื่นไว้โดยเฉพาะให้จัดการดังว่านั้น\\nถ้าผู้ตายมิได้ตั้งผู้จัดการมรดกหรือบุคคลใดไว้ให้เป็นผู้จัดการทำศพ หรือทายาทมิได้มอบหมายตั้งให้บุคคลใดเป็นผู้จัดการทำศพ บุคคลผู้ได้รับทรัพย์มรดกโดยพินัยกรรมหรือโดยสิทธิโดยธรรมเป็นจำนวนมากที่สุด เป็นผู้มีอำนาจและตกอยู่ในหน้าที่ต้องจัดการทำศพ เว้นแต่ศาลจะเห็นเป็นการสมควรตั้งบุคคลอื่นให้จัดการเช่นนั้น ในเมื่อบุคคลผู้มีส่วนได้เสียคนใดคนหนึ่งร้องขอขึ้น'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1428'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1428\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1428\\nคดีอันเกี่ยวกับสิทธิเก็บกินในระหว่างเจ้าของทรัพย์สินกับผู้ทรงสิทธิเก็บกิน หรือผู้รับโอนนั้น ท่านห้ามมิให้ฟ้องเมื่อเกินปีหนึ่งนับแต่วันสิทธิเก็บกินสุดสิ้นลง แต่ในคดีที่เจ้าของทรัพย์สินเป็นโจทก์นั้น ถ้าเจ้าของไม่อาจรู้ว่าสิทธิเก็บกินสุดสิ้นลงเมื่อใด ท่านให้นับอายุความปีหนึ่งนั้นตั้งแต่เวลาที่เจ้าของทรัพย์สินได้รู้ หรือควรรู้ว่าสิทธิเก็บกินสุดสิ้นลง'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1047'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1047\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1047\\nถ้าชื่อของผู้เป็นหุ้นส่วนซึ่งออกจากหุ้นส่วนไปแล้วยังคงใช้เรียกขานติดเป็นชื่อห้างหุ้นส่วนอยู่ ท่านว่าผู้เป็นหุ้นส่วนนั้นชอบที่จะเรียกให้งดใช้ชื่อของตนเสียได้'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1513'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1513\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1513\\nถ้าปรากฏว่าคู่สมรสที่ถูกฟ้องเพิกถอนการสมรสได้รู้เห็นเป็นใจในเหตุแห่งโมฆียะกรรม คู่สมรสนั้นจะต้องรับผิดใช้ค่าทดแทนความเสียหายซึ่งคู่สมรสอีกฝ่ายหนึ่งได้รับต่อกาย ชื่อเสียงหรือทรัพย์สิน เนื่องจากการสมรสนั้น และให้นำมาตรา 1525 มาใช้บังคับโดยอนุโลม\\nถ้าหากการเพิกถอนการสมรสตามวรรคหนึ่งทำให้อีกฝ่ายหนึ่งยากจนลง และไม่มีรายได้พอจากทรัพย์สินหรือจากการงานตามที่เคยทำอยู่ระหว่างสมรส คู่สมรสที่ถูกฟ้องนั้นจะต้องรับผิดในค่าเลี้ยงชีพดังที่บัญญัติไว้ในมาตรา 1526 ด้วย'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '336'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 336\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 336\\nถ้าทรัพย์อันเป็นวัตถุแห่งการชำระหนี้ไม่ควรแก่การจะวางไว้ก็ดี หรือเป็นที่พึงวิตกว่าทรัพย์นั้นเกลือกจะเสื่อมเสีย หรือทำลาย หรือบุบสลายได้ก็ดี เมื่อได้รับอนุญาตจากศาล บุคคลผู้ชำระหนี้จะเอาทรัพย์นั้นออกขายทอดตลาด แล้วเอาเงินที่ได้แต่การขายวางแทนทรัพย์นั้นก็ได้ ความข้อนี้ท่านให้ใช้ตลอดถึงกรณีที่ค่ารักษาทรัพย์จะแพงเกินควรนั้นด้วย'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1038'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1038\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1038\\nห้ามมิให้ผู้เป็นหุ้นส่วนประกอบกิจการอย่างหนึ่งอย่างใดซึ่งมีสภาพดุจเดียวกัน และเป็นการแข่งขันกับกิจการของห้างหุ้นส่วนนั้น ไม่ว่าทำเพื่อประโยชน์ตนหรือประโยชน์ผู้อื่น โดยมิได้รับความยินยอมของผู้เป็นหุ้นส่วนคนอื่น ๆ\\nถ้าผู้เป็นหุ้นส่วนคนใดทำการฝ่าฝืนต่อบทบัญญัติมาตรานี้ไซร้ ผู้เป็นหุ้นส่วนคนอื่น ๆ ชอบที่จะเรียกเอาผลกำไรซึ่งผู้นั้นหาได้ทั้งหมด หรือเรียกเอาค่าสินไหมทดแทนเพื่อการที่ห้างหุ้นส่วนได้รับความเสียหายเพราะเหตุนั้น แต่ท่านห้ามมิให้ฟ้องเรียกเมื่อพ้นเวลาปีหนึ่งนับแต่วันทำการฝ่าฝืน'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '801'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 801\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 801\\nถ้าตัวแทนได้รับมอบอำนาจทั่วไป ท่านว่าจะทำกิจใด ๆ ในทางจัดการแทนตัวการก็ย่อมทำได้ทุกอย่าง\\nแต่การเช่นอย่างจะกล่าวต่อไปนี้ ท่านว่าหาอาจจะทำได้ไม่ คือ\\n(1) ขายหรือจำนองอสังหาริมทรัพย์\\n(2) ให้เช่าอสังหาริมทรัพย์กว่าสามปีขึ้นไป\\n(3) ให้\\n(4) ประนีประนอมยอมความ\\n(5) ยื่นฟ้องต่อศาล\\n(6) มอบข้อพิพาทให้อนุญาโตตุลาการพิจารณา'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '1034'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1034\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1034\\nถ้าได้ตกลงกันไว้ว่าการงานของห้างหุ้นส่วนนั้นจักให้เป็นไปตามเสียงข้างมากแห่งผู้เป็นหุ้นส่วนไซร้ ท่านให้ผู้เป็นหุ้นส่วนคนหนึ่งมีเสียงเป็นคะแนนหนึ่ง โดยไม่ต้องคำนึงถึงจำนวนที่ลงหุ้นด้วยมากหรือน้อย'),\n",
       " Document(metadata={'law_name': 'ประมวลกฎหมายแพ่งและพาณิชย์', 'section_num': '884'}, page_content='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 884\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 884\\nถ้าของซึ่งขนส่งนั้นได้เอาประกันภัยเมื่ออยู่ในระหว่างส่งเดินทางไปท่านให้คิดมูลประกันภัยในของนั้นนับรวมทั้งราคาของ ณ สถานที่และในเวลาที่ผู้ขนส่งได้รับของ และให้เพิ่มค่าระวางส่งของไปยังสถานที่ส่งมอบแก่ผู้รับตราส่ง กับทั้งค่าใช้จ่ายอื่น ๆ เนื่องด้วยการส่งของไปนั้นเข้าด้วย\\nกำไรอันจะพึงได้ในเวลาเมื่อส่งมอบของนั้น ย่อมจะคิดรวมเข้าเป็นมูลประกันภัยได้ต่อเมื่อได้มีข้อตกลงกันไว้เช่นนั้นชัดแจ้ง')]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def batch_document_append(df,start=0, end=len(df)):\n",
    "    documents = []\n",
    "    for index, row in df.iloc[start:end,:].iterrows():\n",
    "        # สร้างเนื้อหาที่มีบริบทชัดเจนในตัวเอง\n",
    "        content = f\"กฎหมาย: {row['law_name']}\\nมาตรา: {row['section_num']}\\nเนื้อหา: {row['section_content']}\"\n",
    "        \n",
    "        # เก็บ Metadata เพื่อใช้ในภายหลัง\n",
    "        metadata = {\n",
    "            \"law_name\": row['law_name'],\n",
    "            \"section_num\": str(row['section_num']),\n",
    "        }\n",
    "        documents.append(Document(page_content=content, metadata=metadata))\n",
    "    return documents\n",
    "\n",
    "documents = batch_document_append(df, start=0, end=50)\n",
    "documents"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "499e6574",
   "metadata": {},
   "source": [
    "## 3. Select LLM"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "ecae64f8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "LLMResponse(content='Hello, World!')"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from neo4j_graphrag.llm import OllamaLLM\n",
    "# llm = OllamaLLM(\n",
    "#     model_name=\"llama3\",\n",
    "#     # model_params={\"options\": {\"temperature\": 0}, \"format\": \"json\"},\n",
    "#     host=\"http://localhost:11434\",  # when using a remote server\n",
    "# )\n",
    "\n",
    "os.environ[\"OPENAI_API_KEY\"] = os.getenv(\"openrouter_API_key\") # ใส่ OpenRouter Key ของคุณตรงนี้\n",
    "\n",
    "# 2. เรียกใช้งาน โดยใส่ base_url กำกับไว้ข้างนอก\n",
    "llm = OpenAILLM(\n",
    "    model_name=\"openai/gpt-4o-mini\", \n",
    "    base_url=\"https://openrouter.ai/api/v1\",\n",
    "    model_params={\n",
    "        \"temperature\": 0\n",
    "    }\n",
    ")\n",
    "llm.invoke(\"say hello-world\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b87a1146",
   "metadata": {},
   "source": [
    "## 4. Graph Construction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "a9e4cb11",
   "metadata": {},
   "outputs": [],
   "source": [
    "# llm = ChatOpenAI(api_key=os.getenv(\"openrouter_API_key\") ,temperature=0, model=\"openai/gpt-4o-mini\", base_url=\"https://openrouter.ai/api/v1\")\n",
    "# llm = OllamaLLM(model=\"llama3\", )\n",
    "entities = [\n",
    "    {\"label\": \"law_name\", \"properties\": [{\"name\": \"text\", \"type\": \"STRING\"}]},\n",
    "    {\"label\": \"section_num\", \"properties\": [{\"name\": \"text\", \"type\": \"STRING\"}]},\n",
    "]\n",
    "\n",
    "relations = [\n",
    "    {\"label\": \"MENTIONS\", \"source\": \"law_name\", \"target\": \"section_num\"},\n",
    "    {\"label\": \"REFERENCES\", \"source\": \"section_num\", \"target\": \"section_num\"},\n",
    "]\n",
    "\n",
    "\n",
    "kg_builder = SimpleKGPipeline(\n",
    "    driver=driver,\n",
    "    llm=llm,\n",
    "    embedder=neo4j_embedder,\n",
    "    entities=entities,\n",
    "    relations=relations,\n",
    "    neo4j_database=DATABASE_NAME,\n",
    "    from_pdf=False\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e988da99",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "You're using a XLMRobertaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.\n"
     ]
    }
   ],
   "source": [
    "for i in range(10):\n",
    "    await kg_builder.run_async(text=documents[i].page_content, document_metadata=documents[i].metadata,)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "39895ffb",
   "metadata": {},
   "source": [
    "## 5. Retrieval"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2048bd3",
   "metadata": {},
   "source": [
    "### 5.1 Vector Retriever เหมือน RAG ธรรมดา"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "28645eb2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize the retriever\n",
    "retriever = VectorRetriever(\n",
    "     driver,\n",
    "     index_name= \"text_embeddings\",\n",
    "     embedder=neo4j_embedder,\n",
    "     return_properties=[\"text\"]\n",
    ")\n",
    "query = \"ถ้ามีคนประกอบกิจการในลักษณะเป็นศูนย์ซื้อขายสัญญาซื้อขายล่วงหน้าโดยไม่ได้รับใบอนุญาตต้องระวางโทษอย่างไร\"\n",
    "result = retriever.search(query_text=query, top_k=10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "5ddd7aea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Score: 0.9035258293151855\n",
      "Content: {'text': 'กฎหมาย: พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546\\nมาตรา: 132\\nเนื้อหา: พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546 มาตรา 132 ผู้ใดประกอบกิจการในลักษณะเป็นศูนย์ซื้อขายสัญญาซื้อขายล่วงหน้าโดยไม่ได้รับใบอนุญาตหรือไม่ได้จดทะเบียนตามมาตรา 54 ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินสามแสนบาท หรือทั้งจำทั้งปรับ และปรับอีกไม่เกินวันละหนึ่งหมื่นบาทตลอดเวลาที่ยังฝ่าฝืน'}\n"
     ]
    }
   ],
   "source": [
    "# ดึงเนื้อหาของอันแรก\n",
    "first_result = result.items[0].content\n",
    "# ดึงค่า Score (ความเหมือน)\n",
    "first_score = result.items[0].metadata['score']\n",
    "\n",
    "print(f\"Score: {first_score}\")\n",
    "print(f\"Content: {first_result}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f56800d",
   "metadata": {},
   "source": [
    "### 5.2 Vector Cypher Retriever \n",
    "- ใช้ Cosine similarity เทียบความคล้าย\n",
    "- Cypher query เข้าไป (ต้องมีการกำหนดเอง ดีที่สุดคืออิงจาก Schema) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "852300bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Node properties:\\nDocument {section_num: STRING, document_type: STRING, path: STRING, createdAt: STRING, law_name: STRING}\\nChunk {index: INTEGER, text: STRING, embedding: LIST}\\nlaw_name {text: STRING}\\nsection_num {text: STRING}\\nRelationship properties:\\n\\nThe relationships:\\n(:Chunk)-[:FROM_DOCUMENT]->(:Document)\\n(:law_name)-[:FROM_CHUNK]->(:Chunk)\\n(:law_name)-[:MENTIONS]->(:section_num)\\n(:law_name)-[:REFERENCES]->(:section_num)\\n(:section_num)-[:FROM_CHUNK]->(:Chunk)'"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "schema = get_schema(driver)\n",
    "schema"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a0165721",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01G11', status_description='warn: null value eliminated in set function', position=None, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: 'CALL db.index.vector.queryNodes($vector_index_name, $top_k * $effective_search_ratio, $query_vector) YIELD node, score WITH node, score LIMIT $top_k \\nMATCH (node:Chunk)\\nOPTIONAL MATCH (law:law_name)-[:FROM_CHUNK]->(node)\\nOPTIONAL MATCH (law)-[:MENTIONS]->(section:section_num)\\nRETURN \\n    node.text AS text,\\n    law.text AS law_title,\\n    collect(section.text) AS related_sections,\\n    node.index AS chunk_index\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record text='กฎหมาย: พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546\\nมาตรา: 132\\nเนื้อหา: พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546 มาตรา 132 ผู้ใดประกอบกิจการในลักษณะเป็นศูนย์ซื้อขายสัญญาซื้อขายล่วงหน้าโดยไม่ได้รับใบอนุญาตหรือไม่ได้จดทะเบียนตามมาตรา 54 ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินสามแสนบาท หรือทั้งจำทั้งปรับ และปรับอีกไม่เกินวันละหนึ่งหมื่นบาทตลอดเวลาที่ยังฝ่าฝืน' law_title='พระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546' related_sections=['132'] chunk_index=0>\n",
      "<Record text='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1598/5\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1598/5\\nถ้าผู้อยู่ในปกครองรู้จักผิดชอบและมีอายุไม่ต่ำกว่าสิบห้าปีบริบูรณ์เมื่อผู้ปกครองจะทำกิจการใดที่สำคัญ ให้ปรึกษาหารือผู้อยู่ในปกครองก่อนเท่าที่จะทำได้\\nการที่ผู้อยู่ในปกครองได้ยินยอมด้วยนั้นหาคุ้มผู้ปกครองให้พ้นจากความรับผิดไม่' law_title='ประมวลกฎหมายแพ่งและพาณิชย์' related_sections=['1598/5'] chunk_index=0>\n",
      "<Record text='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1030\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1030\\nถ้าผู้เป็นหุ้นส่วนคนหนึ่งให้กรรมสิทธิ์ในทรัพย์สินอันใดอันหนึ่งเป็นการลงหุ้นด้วยไซร้ ความเกี่ยวพันระหว่างผู้เป็นหุ้นส่วนคนนั้นกับห้างหุ้นส่วนในเรื่องส่งมอบและซ่อมแซมก็ดี ความรับผิดเพื่อชำรุดบกพร่องก็ดี ความรับผิดเพื่อการรอนสิทธิก็ดี ข้อยกเว้นความรับผิดก็ดี ท่านให้บังคับตามบทบัญญัติแห่งประมวลกฎหมายนี้ ว่าด้วยซื้อขาย' law_title=None related_sections=[] chunk_index=0>\n",
      "<Record text='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 849\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 849\\nการรับเงินหรือรับชำระหนี้อันจะพึงชำระตามสัญญานั้น ท่านให้สันนิษฐานไว้ก่อนว่านายหน้าย่อมไม่มีอำนาจที่จะรับแทนผู้เป็นคู่สัญญา' law_title='ประมวลกฎหมายแพ่งและพาณิชย์' related_sections=['849'] chunk_index=0>\n",
      "<Record text='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 193\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 193\\nในกรณีดังต่อไปนี้ ฝ่ายลูกหนี้จะถือเอาประโยชน์แห่งเงื่อนเวลาเริ่มต้นหรือเงื่อนเวลาสิ้นสุดมิได้\\n(1) ลูกหนี้ถูกศาลสั่งพิทักษ์ทรัพย์เด็ดขาดตามกฎหมายว่าด้วยล้มละลาย\\n(2) ลูกหนี้ไม่ให้ประกันในเมื่อจำต้องให้\\n(3) ลูกหนี้ได้ทำลาย หรือทำให้ลดน้อยถอยลงซึ่งประกันอันได้ให้ไว้\\n(4) ลูกหนี้นำทรัพย์สินของบุคคลอื่นมาให้เป็นประกันโดยเจ้าของทรัพย์สินนั้นมิได้ยินยอมด้วย' law_title='ประมวลกฎหมายแพ่งและพาณิชย์' related_sections=['193'] chunk_index=0>\n",
      "<Record text='กฎหมาย: พระราชบัญญัติหลักประกันทางธุรกิจ พ.ศ. 2558\\nมาตรา: 9\\nเนื้อหา: พระราชบัญญัติหลักประกันทางธุรกิจ พ.ศ. 2558 มาตรา 9 ผู้ให้หลักประกันจะนำทรัพย์สินที่ตนมีสิทธิอยู่ในปัจจุบันหรือที่จะได้มาในอนาคตตามสัญญาหรือนิติสัมพันธ์ใด ๆ มาใช้เป็นหลักประกันก็ได้ แต่สิทธิเหนือทรัพย์สินอันเป็นวัตถุแห่งสิทธิที่เป็นหลักประกันตามสัญญาจะมีขึ้นเมื่อผู้ให้หลักประกันได้มาซึ่งทรัพย์สินนั้น' law_title='พระราชบัญญัติหลักประกันทางธุรกิจ พ.ศ. 2558' related_sections=[] chunk_index=0>\n",
      "<Record text='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 565\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 565\\nการเช่าถือสวนนั้น ท่านให้สันนิษฐานไว้ก่อนว่าเช่ากันปีหนึ่ง\\nการเช่านาก็ให้สันนิษฐานไว้ก่อนว่าเช่ากันตลอดฤดูทำนาปีหนึ่ง' law_title=None related_sections=[] chunk_index=0>\n",
      "<Record text='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 876\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 876\\nถ้าผู้รับประกันภัยต้องคำพิพากษาให้เป็นคนล้มละลาย ผู้เอาประกันภัยจะเรียกให้หาประกันอันสมควรให้แก่ตนก็ได้ หรือจะบอกเลิกสัญญาเสียก็ได้\\nถ้าผู้เอาประกันภัยต้องคำพิพากษาให้เป็นคนล้มละลาย ท่านให้ใช้วิธีเดียวกันนี้บังคับตามควรแก่เรื่อง แต่กระนั้นก็ดี ถ้าเบี้ยประกันภัยได้ส่งแล้วเต็มจำนวนเพื่ออายุประกันภัยเป็นระยะเวลามากน้อยเท่าใดไซร้ ท่านห้ามมิให้ผู้รับประกันภัยบอกเลิกสัญญาก่อนระยะเวลานั้นสุดลง' law_title='ประมวลกฎหมายแพ่งและพาณิชย์' related_sections=['876'] chunk_index=0>\n",
      "<Record text='กฎหมาย: พระราชบัญญัติการบัญชี พ.ศ. 2543\\nมาตรา: 21\\nเนื้อหา: พระราชบัญญัติการบัญชี พ.ศ. 2543 มาตรา 21 ในการลงรายการในบัญชี ผู้ทำบัญชีต้องปฏิบัติ ดังต่อไปนี้\\n(1) ลงรายการเป็นภาษาไทย หากลงรายการเป็นภาษาต่างประเทศให้มีภาษาไทยกำกับ หรือลงรายการเป็นรหัสบัญชีให้มีคู่มือแปลรหัสที่เป็นภาษาไทยไว้\\n(2) เขียนด้วยหมึก ดีดพิมพ์ ตีพิมพ์ หรือทำด้วยวิธีอื่นใดที่ได้ผลในทำนองเดียวกัน' law_title=None related_sections=[] chunk_index=0>\n",
      "<Record text='กฎหมาย: ประมวลกฎหมายแพ่งและพาณิชย์\\nมาตรา: 1598/26\\nเนื้อหา: ประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1598/26\\nผู้เยาว์ที่เป็นบุตรบุญธรรมของบุคคลใดอยู่จะเป็นบุตรบุญธรรมของบุคคลอื่นอีกในขณะเดียวกันไม่ได้ เว้นแต่เป็นบุตรบุญธรรมของคู่สมรสของผู้รับบุตรบุญธรรม\\nถ้าคู่สมรสฝ่ายหนึ่งจะจดทะเบียนรับผู้เยาว์ซึ่งเป็นบุตรบุญธรรมของคู่สมรสอีกฝ่ายหนึ่งเป็นบุตรบุญธรรมของตนด้วยจะต้องได้รับความยินยอมของคู่สมรสซึ่งเป็นผู้รับบุตรบุญธรรมอยู่แล้วและมิให้นำมาตรา 1598/21 มาใช้บังคับ' law_title=None related_sections=[] chunk_index=0>\n"
     ]
    }
   ],
   "source": [
    "chunk_to_law_query = \"\"\"\n",
    "MATCH (node:Chunk)\n",
    "OPTIONAL MATCH (law:law_name)-[:FROM_CHUNK]->(node)\n",
    "OPTIONAL MATCH (law)-[:MENTIONS]->(section:section_num)\n",
    "RETURN \n",
    "    node.text AS text,\n",
    "    law.text AS law_title,\n",
    "    collect(section.text) AS related_sections,\n",
    "    node.index AS chunk_index\n",
    "\"\"\"\n",
    "\n",
    "vector_cypher_retriever = VectorCypherRetriever(\n",
    "    driver=driver,\n",
    "    index_name=\"text_embeddings\",\n",
    "    embedder=neo4j_embedder,\n",
    "    retrieval_query=chunk_to_law_query\n",
    ")\n",
    "\n",
    "result = vector_cypher_retriever.search(query_text=query, top_k=10)\n",
    "for item in result.items:\n",
    "    print(item.content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "7221fcda",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01G11', status_description='warn: null value eliminated in set function', position=None, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: 'CALL db.index.vector.queryNodes($vector_index_name, $top_k * $effective_search_ratio, $query_vector) YIELD node, score WITH node, score LIMIT $top_k \\nMATCH (node:Chunk)\\nOPTIONAL MATCH (law:law_name)-[:FROM_CHUNK]->(node)\\nOPTIONAL MATCH (law)-[:MENTIONS]->(section:section_num)\\nRETURN \\n    node.text AS text,\\n    law.text AS law_title,\\n    collect(section.text) AS related_sections,\\n    node.index AS chunk_index\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ถ้ามีคนประกอบกิจการในลักษณะเป็นศูนย์ซื้อขายสัญญาซื้อขายล่วงหน้าโดยไม่ได้รับใบอนุญาต จะต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินสามแสนบาท หรือทั้งจำทั้งปรับ และปรับอีกไม่เกินวันละหนึ่งหมื่นบาทตลอดเวลาที่ยังฝ่าฝืน ตามพระราชบัญญัติสัญญาซื้อขายล่วงหน้า พ.ศ. 2546 มาตรา 132.\n"
     ]
    }
   ],
   "source": [
    "result = GraphRAG(llm=llm,retriever=vector_cypher_retriever)\n",
    "print(result.search(query_text=query).answer)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "muict_thai_legal_RAG_GraphRAG",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
